docs/todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org06d4ffc"><span class="todo TODO">TODO</span> Rb Control System</a></li>
<li><a href="#orgfc30ef0"><span class="todo TODO">TODO</span> Documentation for Shutter Box</a></li>
<li><a href="#org893b8ba"><span class="todo INPROG">INPROG</span> Assemble Shutter Box</a></li>
<li><a href="#orgb923c78"><span class="todo NEXT">NEXT</span> Ask Mohit about current supplies</a></li>
<li><a href="#orgd499fe8"><span class="todo INPROG">INPROG</span> DeMille Lab onboarding&#xa0;&#xa0;&#xa0;<span class="tag"><span class="uchicago">uchicago</span>&#xa0;<span class="lab">lab</span></span></a></li>
<li><a href="#orgd9c37bb"><span class="todo NEXT">NEXT</span> Machine Shop Training Paper work&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lab">lab</span></span></a></li>
<li><a href="#orgdba4995"><span class="todo INPROG">INPROG</span> Quantum Dynamics Notes + Readings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="uchicago">uchicago</span>&#xa0;<span class="lab">lab</span></span></a></li>
<li><a href="#org22512c7"><span class="todo NEXT">NEXT</span> MCAW Recap</a></li>
</ul>
</div>
</div>
<div id="outline-container-org06d4ffc" class="outline-2">
<h2 id="org06d4ffc"><span class="todo TODO">TODO</span> Rb Control System</h2>
<div class="outline-text-2" id="text-org06d4ffc">
<p>
Add devices, device drivers and gui devices
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> AOM Driver (Grace did this)
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> GUI Device</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> CAEN Power supply (Grace did this)
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> GUI Device</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Current Supplies? (BKPrecision drivers work here)
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> GUI Device (BKPrecision Supplies??)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfc30ef0" class="outline-2">
<h2 id="orgfc30ef0"><span class="todo TODO">TODO</span> Documentation for Shutter Box</h2>
<div class="outline-text-2" id="text-orgfc30ef0">
</div>
</div>
<div id="outline-container-org893b8ba" class="outline-2">
<h2 id="org893b8ba"><span class="todo INPROG">INPROG</span> Assemble Shutter Box</h2>
<div class="outline-text-2" id="text-org893b8ba">
<p>
Run power from 5V
Power switch off of same power from box.
Run forward bias diode from Relay "DC+" to + side of the all the switches. Run other side of all the diodes to the + side of the isolating bnc port. Run the ground side of the isolating bnc to DC- on the relay. Run reverse bias diode from ground of isolating bnc to other side of isolating bnc.
</p>

<p>
Solder small wires from isolating bnc on switch mount to switch in mount.
</p>

<p>
Solder non-isolating BNCs ground together. Run wire from there to XM on relay.
</p>

<p>
Circuit Stuff
</p>
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Cut wire
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> 4 short wire to connect + side of all the switches</li>
<li class="off"><code>[&#xa0;]</code> 4 long green wire to connect ground of all switches (off of isolating bnc)</li>
<li class="off"><code>[&#xa0;]</code> 4 long red wire for nonisolating bnc</li>
<li class="off"><code>[&#xa0;]</code> 4 long green wire for nonisolating bnc</li>
<li class="off"><code>[&#xa0;]</code> 4 short green wire to connect ground of all relay channels</li>
</ol></li>
<li class="off"><code>[&#xa0;]</code> Solder BNC panel mounts</li>
<li class="off"><code>[&#xa0;]</code> Solder wire together
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> solder 4 green wires from nonisolating BNC together to connect ground of all the switches.</li>
<li class="off"><code>[&#xa0;]</code> solder</li>
</ol></li>
<li class="off"><code>[&#xa0;]</code> Diodes
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Solder reverse bias diode from switch output to isolating BNC ground for each switch.</li>
<li class="off"><code>[&#xa0;]</code> Add forward bias diode from banana connector to DC+</li>
</ol></li>
<li class="off"><code>[&#xa0;]</code> Assembly</li>
</ol>

<p>
Assembly of Box      
</p>
</div>
</div>
<div id="outline-container-orgb923c78" class="outline-2">
<h2 id="orgb923c78"><span class="todo NEXT">NEXT</span> Ask Mohit about current supplies</h2>
</div>

<div id="outline-container-orgd499fe8" class="outline-2">
<h2 id="orgd499fe8"><span class="todo INPROG">INPROG</span> DeMille Lab onboarding&#xa0;&#xa0;&#xa0;<span class="tag"><span class="uchicago">uchicago</span>&#xa0;<span class="lab">lab</span></span></h2>
<div class="outline-text-2" id="text-orgd499fe8">
</div>
</div>

<div id="outline-container-orgd9c37bb" class="outline-2">
<h2 id="orgd9c37bb"><span class="todo NEXT">NEXT</span> Machine Shop Training Paper work&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lab">lab</span></span></h2>
<div class="outline-text-2" id="text-orgd9c37bb">
<p>
In email from Pranav
</p>
</div>
</div>
<div id="outline-container-orgdba4995" class="outline-2">
<h2 id="orgdba4995"><span class="todo INPROG">INPROG</span> Quantum Dynamics Notes + Readings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="uchicago">uchicago</span>&#xa0;<span class="lab">lab</span></span></h2>
<div class="outline-text-2" id="text-orgdba4995">
</div>
</div>

<div id="outline-container-org22512c7" class="outline-2">
<h2 id="org22512c7"><span class="todo NEXT">NEXT</span> MCAW Recap</h2>
<div class="outline-text-2" id="text-org22512c7">
<p>
Do this at some point
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
